tutorials/validations4NFFoam/naturalConvection_Kahveci/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions		[0 0 0 1 0 0 0];

internalField		uniform 300.0;

boundaryField
{
    left
    {
        type            fixedValue;
        value           uniform 300.0;
    }

    right
    {
        type            fixedValue;
        value           uniform 310.0;
    }

    ".*"
    {
	type		zeroGradient;
    }
}
// ************************************************************************* //
